---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.IsCellOverridden(System.Int32)
source: html/5cf10123-13e7-b4e1-b925-334beb837ee6.htm
---
# Autodesk.Revit.DB.TableSectionData.IsCellOverridden Method

Indicates if the column is overridden or not.

## Syntax (C#)
```csharp
public bool IsCellOverridden(
	int nCol
)
```

## Parameters
- **nCol** (`System.Int32`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - The given column number nCol is invalid.